.cf.xml/Catalogs/обм_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_КОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_КОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/Catalogs/обм_ИсходящиеСообщения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьКОтправке(пИсходящиеСообщения) Экспорт
	
	ссылкиОбработчиковОтправки = 
		общ.Интерфейс_НайтиРеализации(Метаданные.Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс);

	Если ссылкиОбработчиковОтправки.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;

	исходящиеСообщения = Новый Массив;
	Если ТипЗнч(пИсходящиеСообщения) = Тип("СправочникСсылка.обм_ИсходящиеСообщения") Тогда
		исходящиеСообщения.Добавить(пИсходящиеСообщения);
		
	ИначеЕсли ТипЗнч(пИсходящиеСообщения) = Тип("Массив") Тогда
		исходящиеСообщения = пИсходящиеСообщения;
		
	КонецЕсли;
	
	общ.Проверка_Тип(исходящиеСообщения, Тип("СправочникСсылка.обм_ИсходящиеСообщения"));
	
	запрос = Новый Запрос;
	запрос.УстановитьПараметр("исходящиеСообщения", исходящиеСообщения);
	запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИС.Ссылка КАК ИсходящееСообщение,
	|	ИС.ДатаВремя КАК ДатаВремя,
	|	ИСП.Узел КАК Узел
	|ИЗ
	|	Справочник.обм_ИсходящиеСообщения КАК ИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.обм_ИсходящиеСообщения.Получатели КАК ИСП
	|		ПО ИС.Ссылка = ИСП.Ссылка
	|ГДЕ
	|	ИС.Ссылка В(&исходящиеСообщения)
	|	И ИС.ФлагОшибкиПриСоздании = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИС.ДатаВремя";
	
	выборка = запрос.Выполнить().Выбрать();

	Пока выборка.Следующий() Цикл
		Если ПустаяСтрока(выборка.Узел) Тогда 
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого обработчикСсылка Из ссылкиОбработчиковОтправки Цикл
			записьКОтправке = РегистрыСведений.обм_КОтправке.СоздатьМенеджерЗаписи();
			записьКОтправке.ОбработчикОтправки = обработчикСсылка;
			записьКОтправке.Узел = выборка.Узел;
			записьКОтправке.ИсходящееСообщение = выборка.ИсходящееСообщение;
			записьКОтправке.ДатаВремя = выборка.ДатаВремя;
			записьКОтправке.Записать();
			
		КонецЦикла;
		обработчикСсылка = Неопределено;
		
	КонецЦикла;
	выборка = Неопределено;
	
КонецПроцедуры

Функция Создать(пСсылки) Экспорт
	
	интерфейс = Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс.Создать();
	реализацииИнтерфейса = общ.Интерфейс_НайтиРеализации(интерфейс);
	
	ссылкиСозданных = Новый Массив;
	Если реализацииИнтерфейса.Количество() = 0 Тогда
		Возврат ссылкиСозданных;
		
	КонецЕсли;
	
	Для Каждого ссылкаИсточника Из пСсылки Цикл
		
		Если Не общ.ЭтоЗаполненнаяСсылка(ссылкаИсточника) Тогда
			Продолжить;
			
		КонецЕсли;
		
		исходящие = интерфейс.ИсходящееСообщение_Создать(ссылкаИсточника);
		
		Если исходящие = Неопределено Тогда
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого исходящееОбъект Из исходящие Цикл
			Если ТипЗнч(исходящееОбъект) <> Тип("СправочникОбъект.обм_ИсходящиеСообщения") Тогда
				Продолжить;
			
			КонецЕсли;
			
			исходящееОбъект.Записать();
			
			ссылкиСозданных.Добавить(исходящееОбъект.Ссылка);

		КонецЦикла;
		исходящееОбъект = Неопределено;
		
	КонецЦикла;
	ссылкаИсточника = Неопределено;
	
	Возврат ссылкиСозданных;
	
КонецФункции

Функция ИсходящееСообщение_Отправить(пИсходящееСообщение, пУзел, пОбработчик = Неопределено) Экспорт
	
	отправитель = Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка.Создать();
	отправитель.ИсходящееСообщение_Отправить(пИсходящееСообщение, пУзел, пОбработчик);
	
	записьОбОтправке = РегистрыСведений.обм_ОтправленныеСообщения

КонецФункции


#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
